tap "buo/cask-upgrade"
tap "etolbakov/taps"
tap "jsdelivr/globalping"
tap "martido/graph"
tap "supabase/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Mozilla CA bundle for Python
brew "certifi"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Linter and formatter to improve copywriting, correct spaces, words between CJK
brew "autocorrect"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Core utilities for Python packages
brew "python-packaging"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Scan for endpoints, secrets, API keys, file extensions, tokens and more
brew "cariddi"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Change Source for every software on every platform from the command-line
brew "chsrc"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Tool that bootstraps your dotfiles
brew "dotbot"
# AST-based pattern checker for JavaScript
brew "eslint"
# Command-line tool for porting Excalidraw diagrams to Gliffy
brew "excalidraw-converter"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Zip password cracker
brew "fcrackzip"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# MP3 player for Linux and UNIX
brew "mpg123"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# GNU compiler collection
brew "gcc"
# GNU compiler collection
brew "gcc@9"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Git blame for file trees
brew "git-who"
# Audit git repos for secrets
brew "gitleaks"
# Linting for your git commit messages
brew "gitlint"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Generates server-side and client-side code for web and RPC services
brew "goctl"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Like cURL, but for gRPC
brew "grpcurl"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Static analysis tool for Kubernetes YAML files and Helm charts
brew "kube-linter"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Portable library for network traffic capture
brew "libpcap"
# Fast and simple video downloader
brew "lux"
# Fast, async, resource-friendly link checker
brew "lychee"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Command-line markdown todo list manager
brew "mdt"
# Run a Kubernetes cluster locally
brew "minikube"
# Mock code autogenerator for Golang
brew "mockery"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# UNIX movie player
brew "mplayer"
# Open source relational database management system
brew "mysql-client@8.0"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# PNG file optimizer
brew "optipng"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Data loading tool for PostgreSQL
brew "pgloader"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Generic syntax highlighter
brew "pygments"
# Rsync for cloud storage
brew "rclone"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Non-interactive SSH password auth
brew "sshpass"
# Subdomain discovery tool
brew "subfinder"
# Tool to detect and prevent secrets from getting checked in
brew "talisman"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Simple file transfer tools, similar to lrzsz (rz/sz), and compatible with tmux
brew "trzsz-go"
# Undo git commands. Your damage control git buddy
brew "ugit"
# View/select the URLs in an email message or file
brew "urlscan"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# HTTP load testing tool and library
brew "vegeta"
# Modern watch command
brew "viddy"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Rust-based utility to convert docker-compose.yaml files into excalidraw files.
brew "etolbakov/taps/excalidocker"
brew "jsdelivr/globalping/globalping"
# Supabase CLI
brew "supabase/tap/supabase"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Cross-device interconnection service for the Xiaomi ecosystem
cask "hyperconnect"
# Another Mihomo GUI
cask "mihomo-party"
# Cleanup and system status tool
cask "tencent-lemon"
# Free messaging and calling application
cask "wechat"
